#################
# CLI           #
#################

# Shell
brew "zsh"

# GNU utils
brew "colordiff"
brew "coreutils"
brew "gawk"
brew "gnu-sed"
brew "grep"
brew "watch"
brew "wget"

# Parallel tools
# brew "parallel"
# brew "hyperfine"


# "better" GNU utils
brew "bat"
brew "fd"
brew "fzf"
brew "git-delta"
brew "ripgrep"

# jq
brew "jq"
brew "gojq"

# Git
brew "git"
brew "git-gui"

# Graphics
brew "graphviz"
brew "imagemagick"

#################
# D E S K T O P #
#################

# Fonts
tap "homebrew/cask-fonts"
cask "font-fontawesome"
cask "font-fira-code-nerd-font"

# Accessibility hacks
# cask "bettertouchtool"
# cask "hammerspoon"
# cask "karabiner-elements"
# cask "rectangle"
cask "keepingyouawake"
cask "keyboardcleantool"

# Logitech
# tap "homebrew/cask-drivers" # for logitech-*
# cask "logitech-g-hub"    # mouse
# cask "logitech-options"  # keyboards MX Keys + K380
# cask "logitech-unifying" # unifying receiver

# Browser
cask "firefox"
cask "google-chrome"

# Terminal
cask "kitty"

# Editors / Office
cask "adobe-acrobat-reader"
cask "macvim"
cask "mark-text"
cask "notion"
cask "simple-comic"

# Productivity
cask "ticktick"

# Internet
# cask "dropbox"
cask "google-drive"
cask "mullvadvpn"
cask "transmit"

# Music
cask "spotify"

# Editors
cask "macvim"
cask "visual-studio-code"

# Record GIFs
# cask "licecap"

# Messenger
cask "discord"
cask "signal"
cask "telegram-desktop"
cask "whatsapp"
# cask "skype"
# cask "slack"
# cask "zoom"

# Password / Security
cask "1password"
cask "ledger-live"
# cask "cryptomator"

# Backup / Disk utils
# cask "arq"
# cask "daisydisk"
